[{"site_name":"B \u0026 O Railroad Museum","id":42,"park_id":"B\u0026O","feature_name":"B \u0026 O Railroad Museum","address1":"3711 Maryland AVE","address2":"Ellicott City, MD 21043","description":"A National Historic Landmark, the Baltimore and Ohio (B\u0026O) Railroad Station in Ellicott City is the oldest railroad station in the United States. Erected in 1830-31, the station served as the terminus of the railroad’s original 13-mile section of track. In service until 1972, the station is now a living history museum offering programs and exhibits that explore the development of transportation in America and the station’s role in historical events of the 19th and 20th centuries. The museum is located at the intersection of Main St. and Maryland Ave. in the Historic District of Ellicott City. Hours are Wed. – Sun., 11 am – 4pm. Admission: $5 adults, $4 seniors (60+), $3 ages 2-12. For information, call 410-461-1945 or visit ecbo.org.","feature_type":"HISTORIC","feature_id":"B\u0026O","latitude":39.267304111149677,"longitude":-76.795012110958652},{"site_name":"Belmont Manor and Historic Park","id":40,"park_id":"BMT","feature_name":"Belmont Manor and Historic Park","address1":"6555 BELMONT WOODS RD","address2":"Elkridge, MD 21075","description":"Belmont History\\\\n\\\\nIn 1732, Caleb Dorsey, of Annapolis and Hockley-in-the Hole on the Severn River had purchased the land in which Belmont now resides. Caleb Dorsey’s son had several iron forges on the creeks that fed onto the Patapsco River. A bustling and prosperous port thrived then in Elkridge. One of Dorsey’s sons, also named Caleb, was an avid foxhunter. Once, while tracking a rare gray fox, he found himself in unfamiliar territory, near the home of Priscilla Hill. Their fortuitous meeting resulted in friendship, then marriage. The elder Dorsey gave the land to his son as a wedding present and the younger Caleb built the manor house. On either side of the front door were placed two carved plaques, “CPD 1738”. Caleb and Priscilla had three sons and six daughters. When Caleb died in 1772, his son Edward inherited the property, along with the iron forges and several other tracts of land.\\\\n\\\\nAfter Edward died, his headstrong daughter, also named Priscilla, gained ownership of Belmont. Priscilla eloped with Alexander Hanson in 1805. Hanson founded the Federal Republican, a pro British newspaper and he poured money into the endeavor. Hanson’s unpopular views resulted in his being attacked during the war of 1812 and he suffered permanent injuries. In 1815, Priscilla received her inheritance, Edward Dorsey’s property that she would name Belmont.\\\\n\\\\nAfter Hanson’s death at the age of 33, Priscilla tried to run the farm, but financial problems beset her and she sold parcels of land in the 1830’s. In 1839, she mortgaged the estate for $1,500. Realizing that her son, Charles, was addicted to horses and gaming, Priscilla stated in her will that if Charles ever compromised the estate, it was to be transferred to his wife and to her family. In 1875, the property went to a sheriff’s auction, where it brought $25. However, because of Priscilla’s foresight, the auction was contested and the property reverted back to Charles’ children in 1879. His daughters Anna Marie and Florence stayed on the property while other siblings moved away.\\\\n\\\\nIn 1917, the property passed to Mary Bowdoin Bruce, a descendant of Caleb and Priscilla Dorsey. Mary and her husband, Howard, restored the estate to its original beauty. Howard Bruce was the vice president and general manager of Bartlett Hayward Company, a small steel factory. His prominence increased during World War I, and he became well respected in the financial and political arenas. During World War II, he was awarded the Distinguished Service Medal for his vital contribution to the war production effort.\\\\n\\\\nAlthough Belmont remained a working farm, Bruce’s predominant interest was in raising and breeding his stable of thoroughbred horses. He became the owner of the famed Billy Barton, who won numerous races including the Grand National Handicaps and the coveted Maryland Hunt Cup. Billy Barton is buried with full tack on, in an upright position, alongside another one of Bruce’s horses near the time-worn barn. In 1961, after Howard Bruce’s death, the property passed to his cousin David Bruce, the former ambassador to Britain, who in turn gave Belmont to the Smithsonian Institute. The Smithsonian converted Belmont into a conference center, where generals, vice presidents, astronauts and many other notables were able to meet in a quiet and controlled setting.\\\\n\\\\nIn 1983, the 85 acre estate was sold to the American Chemical Society, which continued the tradition of providing excellent hospitality to the world leaders.\\\\n\\\\nIn 2004, Belmont was purchased by Howard Community College. The Community College added hospitality classes to the Belmont experience while continuing the same traditions as the two previous owners.\\\\n\\\\nOn June 21, 2012, Howard County Government purchased Belmont to ensure the stewardship of this beautiful site for the residents of Howard County. When fully operational, Belmont will become a popular venue for executive retreats, corporate trainings, weddings, company picnics and other special events. Environmental, preservation and historical programs will also be major components of the management plan.","feature_type":"HISTORIC","feature_id":"BMT","latitude":39.227059171346866,"longitude":-76.74408943528482},{"site_name":"Bollman Truss Bridge","id":67,"park_id":"BTB","feature_name":"Bollman Truss Bridge","address1":"Foundry ST","address2":"Savage, MD 20763","description":"The Bollman Truss Bridge is the only known remaining example of the revolutionary all-iron truss system patented by Baltimore engineer Wendell Bollman in the mid-19th century. Constructed in 1869, the bridge was moved to its current site in 1888 and was in use until 1915. Designated a National Historic Landmark in 2000, it is now utilized as a pedestrian bridge connecting Historic Savage Mill with the Mill Trail, a walk linking old mill sites along the Patuxent River.","feature_type":"HISTORIC","feature_id":"BTB","latitude":39.134890990233025,"longitude":-76.825049287109778},{"site_name":"Ellicott City Colored School House","id":49,"park_id":"CSH","feature_name":"Ellicott City Colored School House","address1":"8699 FREDERICK RD","address2":"Ellicott City, MD 21043","description":"This one-room schoolhouse building was constructed in 1880 as the first public school for black children in Howard County. In use as a school until the early 1950’s, the building was re-purchased by the county in 1995 and restored with the assistance of public and private funding. The building, located at 8683 Frederick Road, Ellicott City, now houses a genealogical resource center and a museum chronicling the history of African Americans in Howard County. Changing exhibits and seminars highlight the contributions by people of color to the history of the region. Tours are offered Saturday and Sunday at 3 PM, April through October. Private and group tours are available year-round, weather permitting.","feature_type":"HISTORIC","feature_id":"CSH","latitude":39.268891889215318,"longitude":-76.810614999960436},{"site_name":"Ellicott City Firehouse Museum","id":52,"park_id":"EFM","feature_name":"Ellicott City Firehouse Museum","address1":"3829 CHURCH ST","address2":"Ellicott City, MD 21043","description":"Located in the County’s first firehouse at the intersection of Main St. and Church Rd. in Historic Ellicott City, the Firehouse Museum houses a wide array of fire apparatus, model toys, and an impressive visual history of Howard County’s Volunteer Fire Department. The firehouse was constructed by volunteers in 1889 and after 1923 used as a meeting hall, county office space, and library reading room before opening as a museum. Visit the Firehouse Museum Saturday and Sunday at 1-4 PM, April through December. Private and group tours are available year-round, weather permitting.","feature_type":"HISTORIC","feature_id":"EFM","latitude":39.26764567174785,"longitude":-76.798286601780248},{"site_name":"Hebb House","id":80,"park_id":"HEH","feature_name":"Hebb House","address1":"12985 Frederick RD","address2":"West Friendship, MD 21794","description":"TBD","feature_type":"HISTORIC","feature_id":"HEH","latitude":39.305066697749133,"longitude":-76.964793505344517},{"site_name":"Heritage Orientation Center","id":54,"park_id":"LCH","feature_name":"Heritage Orientation Center","address1":"8334 MAIN ST","address2":"Ellicott City, MD 21043","description":"The Heritage Orientation Center is located behind the Thomas Isaac Log Cabin in the county’s first Court Records building. View unique exhibits on the 18th and 19th Century milling techniques, floods of Ellicott Mills, and the Ellicott Family. The center is open daily from 11 AM–4 PM","feature_type":"HISTORIC","feature_id":"LCH","latitude":39.2689665715351,"longitude":-76.8009977142687},{"site_name":"James Marlow House","id":55,"park_id":"JMH","feature_name":"James Marlow House","address1":"12975 HALL SHOP RD","address2":"Highland, MD 20777","description":"The James Marlow House, circa 1840, was originally built as a two-story structure with one room on each floor. The exterior walls were log and chink construction. The house is significant as a prototype of rural, agrarian vernacular architecture from the Howard County region of Maryland. The County has restored the house to its post Civil War era configuration except for interior enrichments of 1924 which have been retained.","feature_type":"HISTORIC","feature_id":"JMH","latitude":39.16739800895499,"longitude":-76.958654760858479},{"site_name":"James Sykes House","id":81,"park_id":"JSH","feature_name":"James Sykes House","address1":"","address2":"","description":"Little is known about the James Sykes House. Local historians claim that it was Mr. Sykes’ office for various businesses. It is a small 500 square foot frame house with a stone fireplace built on the ground floor. It was said to be the lone survivor of the flood of 1868 in Sykesville.","feature_type":"HISTORIC","feature_id":"JSH","latitude":39.362344463011063,"longitude":-76.969338096482716},{"site_name":"Patapsco Female Institute","id":19,"park_id":"PFI","feature_name":"Patapsco Female Institute","address1":"3655 CHURCH RD","address2":"Ellicott City, MD 21043","description":"Situated on a hilltop overlooking the Patapsco River Valley, The Patapsco Female Institute was founded in 1837 as an elegant finishing school for young women. The stabilized ruins of the Greek revival structure are open for tours, and serve as a beautiful setting for special events including weddings, receptions, camps, and open-air theatre. The Patapsco Female Institute Historic Park is located at 3655 Church Road in historic Ellicott City. Tours are on Saturday and Sunday at 1:30 PM, April through October. Private and group tours are available year-round, weather permitting. For more information and scheduling special events and rentals, call 410-313-0420.","feature_type":"HISTORIC","feature_id":"PFI","latitude":39.270725169360439,"longitude":-76.796696622963182},{"site_name":"Pfeiffer\u0027s Corner Schoolhouse","id":56,"park_id":"PCS","feature_name":"Pfeiffer\u0027s Corner Schoolhouse","address1":"6109 ROCKBURN BRANCH PARK RD","address2":"Elkridge, MD 21075","description":"Originally constructed about 1883, the Pfeiffer\u0027s Corner Schoolhouse is one of the very few remaining one-room schools in Howard County and is now fully restored. Children were educated within its walls for over 50 years until it was converted into a residence in the 1940\u0027s. It was almost demolished when new homes were built on the property in the 1980\u0027s, but was saved through the efforts of local school children. They raised funds to have it moved in 1988 to county-owned parkland along route 108 near Clarksville, where it stood for several years until a permanent location could be found. In 2003, it was moved to Rockburn Branch Park where it will illustrate the changes a 100-year time span has brought to our schools, serve as a historic exhibit in conjunction with the adjacent Clover Hill restoration, and be used for demonstration classes, interpretive tours, and small meetings. ","feature_type":"HISTORIC","feature_id":"PCS","latitude":39.216491279736026,"longitude":-76.769517693478818},{"site_name":"Thomas Isaac Log Cabin","id":53,"park_id":"TLC","feature_name":"Thomas Isaac Log Cabin","address1":"8394 MAIN ST","address2":"Ellicott City, MD 21043","description":"Named after its late 19th century owner, this rustic structure was built circa 1780 as a settler’s home of Ellicotts Mills. The cabin was reconstructed on the present site in the late 20th Century. Here, visitors can learn about the settlement and development of the region and artisans. The cabin is located at the intersection of Main Street and Ellicott Mills Drive in Historic Ellicott City, and open Saturday and Sunday at 1-4 PM, April through early December. Private and group tours are available year-round, weather permitting.","feature_type":"HISTORIC","feature_id":"TLC","latitude":39.268772000116321,"longitude":-76.801098999938048},{"site_name":"Waverly Mansion","id":57,"park_id":"WAM","feature_name":"Waverly Mansion","address1":"2300 WAVERLY MANSION DR","address2":"Marriottsville, MD 21104","description":"Historic Waverly Mansion is associated with many of the founding families of Maryland and is listed on the National Register of Historic Places. Nathan Dorsey, son of Colonel John Dorsey, built the main section of the mansion between 1756 and 1764. The property was later sold to Revolutionary War hero, Colonel John Eager Howard, governor of Maryland from 1788 to 1790. Colonel Howard gave the house and land to his son, George, who later also served as governor of the state (1831-33). George Howard and his wife, Prudence, a member of the Ridgeley family, named their estate after the popular Sir Walter Scott novel, Waverley.\\\\n\\\\n With its mid-18th century architecture, meticulously restored interior rooms, modern amenities and beautifully landscaped grounds and gardens, Waverly Mansion\u0027s one-of-a-kind setting adds just the right atmosphere to every occasion. Surprise friends, influence business associates and make wedding memories that last a lifetime.\\\\n\\\\n Waverly mansion is owned by Howard County Recreation and Parks, and operated and managed by Uptown Caterers.","feature_type":"HISTORIC","feature_id":"WAM","latitude":39.310055950192876,"longitude":-76.895822064071325}]