[{"site_name":"Alpha Ridge Park","id":16,"park_id":"ARP","feature_name":"Alpha Ridge Park","address1":"11685 OLD FREDERICK RD","address2":"Marriottsville, MD 21104","description":"Howard Astronomical League Observatory: The structure is 18’x18’ with a 15-foot diameter dome that houses the Paul S. Watson telescope, a 12-inch Newtonian telescope originally built in 1937 and restored for use today. The observatory will host monthly star parties and other programs coordinated between Recreation \u0026 Parks and the Howard Astronomical League.\\\\n\\\\nExclusive to this 72-acre park is a small inline hockey rink, as well as a regulation-size rink with bleachers. There are 2 tennis courts, 3 ball diamonds, 2 multipurpose fields, 2 playgrounds and 2 identical 60-person capacity picnic pavilions (first-come, first-serve basis unless reserved), waiting for you to Get Up, Get Out and Get Active!","feature_type":"PARK","feature_id":"ARP","latitude":39.319500137385994,"longitude":-76.913530418007767},{"site_name":"Atholton Park","id":62,"park_id":"ATH","feature_name":"Atholton Park","address1":"6875 GREENLEIGH DR","address2":"Columbia, MD 21046","description":"This 9-acre park is located behind Atholton Elementary School and offers 2 tennis courts, 2 playgrounds (one for 5-12 year olds and one swing set area), 2 picnic tables, one small grill, and 3 handball/racquetball courts, plus a multi-sport rebound wall. A short paved pathway provides access to an area reforested for resource conservation and protection suitable for bird watching. There is also a restroom facility.","feature_type":"PARK","feature_id":"ATH","latitude":39.186150156447759,"longitude":-76.866316730053043},{"site_name":"Blandair Park","id":58,"park_id":"BLA","feature_name":"Blandair Park","address1":"5750 Oakland Mills Rd","address2":"Columbia, MD 21045","description":"Phase I of Blandair Park, now open to the public, encompasses 25 acres. Once the final phase is complete, the park will be 300 acres. Amenities now available include three lighted synthetic turf multipurpose fields, press boxes and bleachers, along with a playground and a parking lot. Phase I of Blandair Park eventually will include a pavilion and comfort station. The park is conveniently located on Oakland Mills Road, one-third of a mile north past the intersection of Old Montgomery Road and Oakland Mills Road. Stay tuned for future updates on Howard County’s newest park!","feature_type":"PARK","feature_id":"BLA","latitude":39.211048697069515,"longitude":-76.835291920872749},{"site_name":"Cedar Lane Park","id":11,"park_id":"CLP","feature_name":"Cedar Lane Park","address1":"5081 CEDAR LN","address2":"Columbia, MD 21044","description":"Cedar Lane Park is recognized as one of the finest and most popular sports complexes in Howard County. A .8-mile paved pathway connects the park’s two main areas, which cover 93 acres. The West area includes 2 lighted synthetic turf fields, 4 lighted ball diamonds, Restrooms, Playground with outdoor fitness equipment, Volleyball Courts, Bocce Courts, and a Pavilion (Which is on a first-come, first-served basis, unless reserved). The East Area includes 2 natural grass multi-purpose fields available for scheduled use, basketball courts, 4 tennis courts, playground, Pavilion (Which is on a first-come, first-served basis, unless reserved), Horseshoe pits, and restrooms. Fitness programs are held in the indoor facility located in the West Area. The park is open from 7 AM to dusk or as posted. Personal grills and hibachis are not permitted. Park regulations prohibit hunting, firearms, and alcoholic beverages. Leashed pets are allowed in the park but not in picnic, playground or sports areas. Howard County law requires owners to clean up after their pets.","feature_type":"PARK","feature_id":"CLP","latitude":39.231133897427739,"longitude":-76.885206484320079},{"site_name":"Cedar Villa Heights Park","id":39,"park_id":"CVH","feature_name":"Cedar Villa Heights Park","address1":"8361 LINCOLN DR","address2":"Jessup, MD 20794","description":"This three-acre park offers a tennis court, a full basketball court, two playgrounds, a paved trail and more.","feature_type":"PARK","feature_id":"CVH","latitude":39.171740367734131,"longitude":-76.794271992286923},{"site_name":"Centennial Park","id":78,"park_id":"CEN","feature_name":"Centennial Park","address1":"10000 Clarksville PK","address2":"Ellicott City, MD 21042","description":"Centennial Park has won awards for its natural design and sensitivity to nature. The 337-acre park features a spectacular 54-acre, man-made lake, which is stocked by the State Department of Fisheries, and is home to a variety of wildlife such as white-tailed deer, beavers, foxes, turtles, herons, and many other bird species.\\\\n\\\\nYou can walk, run or bike the 2.6-mile paved pathway that meanders around the lake or the 7.3 miles of interconnecting paved pathway that includes links to surrounding neighborhoods. Cast for bass, trout, sunfish and tiger muskies. The park has four main areas: North, South, East, and West, each with a separate entrance. Included are 9 picnic pavilions available on a first-come-first-served basis, unless reserved, and 3 first-come-first-served picnic areas (propane grills are not permitted). From late spring through early fall, boats are available for rent at the General Store/Boat Rental Office located in the park\u0027s South area. The park is open from 7am to dusk or as posted. Park regulations prohibit hunting, firearms, swimming, sail boarding, wind surfing, and inner tubing. Alcoholic beverages are allowed only in the pavilions by permit. Leashed pets are allowed in the park but not in picnic, playground, or sports areas. Howard County law requires owners to clean up after their pets.","feature_type":"PARK","feature_id":"CEN","latitude":39.242448387986471,"longitude":-76.8524745110658},{"site_name":"Cypressmede Park","id":9,"park_id":"CYP","feature_name":"Cypressmede Park","address1":"3100 FAWN WOOD DR","address2":"Ellicott City, MD 21043","description":"A ball diamond (all grass), playground, tennis and basketball courts can be found at this 21-acre park. A walk through the woods on a .7-mile natural and woodchip surface trail will make you feel like you are miles away. Enjoy! ","feature_type":"PARK","feature_id":"CYP","latitude":39.28504014290349,"longitude":-76.853620869948571},{"site_name":"David Force Natural Resource Area & Community Park","id":48,"park_id":"DFP","feature_name":"David Force Natural Resource Area & Community Park","address1":"2995 PEBBLE BEACH DR","address2":"Ellicott City, MD 21042","description":"Here is a 221-acre natural resource area that is relatively undisturbed. This area is allowed to remain as an important forested area to protect water quality, provide habitat for wildlife, and support recreational hiking and nature observation.\\\\n\\\\nThis site is sandwiched between Interstate 70 in the north and US Route 40 to the south. The main entrance is located on the southern edge of the property off of Pebble Beach Drive in the Community of Turf Valley. The area surrounding is mostly residential and Turf Valley Country Club is positioned to the north and west of this location. There are no restroom facilities at this site.\\\\n\\\\n“Howard County has a multitude of natural resources that add to the County’s character and it is imperative that they are protected to help maintain the high quality of life that Howard County residents enjoy. The natural resources of the County are finite. As development continues and the County nears build-out, the protection of these resources will become increasingly vital to protecting the health and quality of life of Howard County’s citizens, wildlife and the natural environment”. These are words taken directly from the Comprehensive Recreation, Parks and Open Space Plan developed by the Howard County Department of Recreation \u0026 Parks. They clearly indicate the Department’s commitment to natural resource stewardship.\\\\n\\\\nHistory\\\\n\\\\n The park is named after David W. Force who was a County Commissioner in the 1960’s. He was the equivalent to the County Executive; however, the County was not yet in its current form of charter government at that time. David W. Force lived in Ellicott City on Folly Quarter Road. Prior to becoming County Commissioner, he owned a trucking business that served the railroad industry. ","feature_type":"PARK","feature_id":"DFP","latitude":39.2902444525233,"longitude":-76.8702726003524},{"site_name":"Dayton Oaks Park","id":6,"park_id":"DAY","feature_name":"Dayton Oaks Park","address1":"4691 TEN OAKS RD","address2":"Dayton, MD 21036","description":"Located north of Dayton Oaks Elementary School, this 12.6-acre park has 2 multipurpose fields and 2 ball diamonds, which overlap each other, as well as 2 tennis courts and a playground. In addition, a small community picnic shelter with 8 picnic tables is available (first-come-first-served unless previously reserved). Dayton Oaks Park also has a .5 mile pathway system that loops around the fields. Come and enjoy this wonderful delight.","feature_type":"PARK","feature_id":"DAY","latitude":39.242350517562869,"longitude":-76.982730214676991},{"site_name":"Dickinson Park","id":18,"park_id":"DIC","feature_name":"Dickinson Park","address1":"7455 EDEN BROOK DR","address2":"Columbia, MD 21046","description":"Grab the family and head to Dickinson Park, which is located within the Village of Kings Contrivance. There you can use basketball courts, a ball diamond (permit use only), a natural grass multipurpose field (permit use only), and a .25-mile paved trail to keep your family active. Don’t forget to take the kids to the playground and separate swing area, which includes a purple dinosaur slide!","feature_type":"PARK","feature_id":"DIC","latitude":39.166094002656514,"longitude":-76.869708214768},{"site_name":"East Columbia Library Park","id":25,"park_id":"ECL","feature_name":"East Columbia Library Park","address1":"6600 CRADLEROCK WAY","address2":"Columbia, MD 21045","description":"Beautiful fields are tucked behind the East Columbia Library in the Village of Owen Brown. If you are a sports fan or athlete, this is the ideal location. This 16-acre site includes three multipurpose fields suitable for soccer, lacrosse, football or rugby. All must be reserved by permit. There are also paved walking paths that connect to the library and the Owen Brown Village Center. Restrooms can be opened when fields are permitted and they are requested by the renter.","feature_type":"PARK","feature_id":"ECL","latitude":39.188486568546026,"longitude":-76.846407025567217},{"site_name":"Font Hill Wetlands Park","id":60,"park_id":"FHP","feature_name":"Font Hill Wetlands Park","address1":"3520 Font Hill Dr","address2":"Ellicott City, MD 21043","description":"This 26 acre park presents many opportunities to observe and study wetlands and their wildlife. The environmental education park includes three interconnecting ponds with a surrounding boardwalk to provide a perfect place for wildlife and visitors alike. Paved pathway surface combined with the wooden boardwalk create a unique trail that winds through marshes filled with cattails and a variety of native trees and vegetation. In addition to the pathways, there are observation areas and fishing piers (fishing in large pond only). Completed in November 1997, this park was the first State/County/Private sector cooperative wetland project in the State of Maryland. The list of wildlife found at Font Hill is noteworthy. Included are 104 species of birds, 53 species of dragonflies and damselflies, at least 7 species of amphibians, and numerous species of mammals. The diverse wetlands habitat of Font Hill Park has produced some of the most prolific and varied populations of dragonflies in the entire County. Street parking is available.","feature_type":"PARK","feature_id":"FHP","latitude":39.272432211255619,"longitude":-76.859740843361578},{"site_name":"Guilford Park","id":3,"park_id":"GUI","feature_name":"Guilford Park","address1":"9900 GUILFORD RD","address2":"Jessup, MD 20794","description":"This 11 acre park has 2 tennis courts, a basketball court, a ball diamond (permit use only), playground and picnic pavilion proves that this park has something for everyone! An added bonus is the ½-acre pond, complete with a gazebo and fishing pier. A .6 mile paved pathway provides you with easy access to each amenity you wish to visit! All persons over 16 years old must possess a Maryland fishing license to fish in the pond.","feature_type":"PARK","feature_id":"GUI","latitude":39.155263999979944,"longitude":-76.8219863227552},{"site_name":"Hammond Park","id":32,"park_id":"HAM","feature_name":"Hammond Park","address1":"10700 GLEN HANNAH DR","address2":"Laurel, MD 20723","description":"This is a 43-acre park featuring 4 tennis courts, a ball diamond, playground and picnic pavilion (first-come, first-served), this is a perfect place to have a party, or spend a relaxing afternoon with the family. Don\u0027t forget to check out the 1.5-mile trails, streams, and surrounding woodlands before you leave.","feature_type":"PARK","feature_id":"HAM","latitude":39.14557011491862,"longitude":-76.882367086166141},{"site_name":"Harwood Park","id":15,"park_id":"HAR","feature_name":"Harwood Park","address1":"6450 FOREST AVE","address2":"Elkridge, MD 21075","description":"There is a 2 acre hidden gem in Elkridge located within the Harwood Neighborhood off Route 1. Play basketball, have a picnic, or take the kids to the playground for an afternoon of fun. Now is the time for a new adventure in this established community!","feature_type":"PARK","feature_id":"HAR","latitude":39.1910097298146,"longitude":-76.737267714115475},{"site_name":"High Ridge Park","id":14,"park_id":"HRP","feature_name":"High Ridge Park","address1":"10100 SUPERIOR AVE","address2":"Laurel, MD 20723","description":"Bordering the Patuxent River, this 88 acre park’s amenities include a tennis court, basketball court, gazebo, picnic pavilion, playground, and one mile of pathway trails. Only 6 out of 88 acres of this parkland are developed, so be sure to watch for wandering wildlife! ","feature_type":"PARK","feature_id":"HRP","latitude":39.113475702704939,"longitude":-76.867380519362584},{"site_name":"Holiday Hills Park","id":5,"park_id":"HHP","feature_name":"Holiday Hills Park","address1":"10524 VISTA RD","address2":"Columbia, MD 21044","description":"Play a game of volleyball, basketball, or tennis at the courts at Holiday Hills. This 6-acre park also offers an approximate .45-mile paved path, three picnic table areas, and a playground.","feature_type":"PARK","feature_id":"HHP","latitude":39.180846518770409,"longitude":-76.879359652443057},{"site_name":"Huntington Park","id":2,"park_id":"HUN","feature_name":"Huntington Park","address1":"9695 CLOCK TOWER LN","address2":"Columbia, MD 21046","description":"Come to this 11-acre park and take advantage of the ball diamond (permit use only, all grass with a backstop) and multipurpose field (permit use only). The park also includes .2 miles of trails, basketball courts and a playground to satisfy the kids!","feature_type":"PARK","feature_id":"HUN","latitude":39.161318855020774,"longitude":-76.846972070803119},{"site_name":"Lisbon Park","id":7,"park_id":"LIS","feature_name":"Lisbon Park","address1":"15901 FREDERICK RD","address2":"Woodbine, MD 21797","description":"Good things come in small packages, and this 9-acre park is no exception! Play a game of tennis, explore the newly renovated playground – there’s an impressive climbing structure in it - or simply walk, bike or skate around the paved circular pathway. After you are through, relax on one of the benches inside the gazebo overlooking the path. All of this fun is located directly in front of Lisbon Elementary School on Route 144 in western Howard County","feature_type":"PARK","feature_id":"LIS","latitude":39.334684326387254,"longitude":-77.068470319384531},{"site_name":"Martin Road Park","id":20,"park_id":"MAR","feature_name":"Martin Road Park","address1":"6701 MARTIN ROAD","address2":"Columbia, MD 21044","description":"The 6-acre Martin Road Park features a playground, .27 miles paved pathway, picnic tables, grill, basketball courts, and a multipurpose field (permit use only). Don’t forget to bring your bicycle or roller skates to take advantage of the paved pathway! There is also a restroom facility.","feature_type":"PARK","feature_id":"MAR","latitude":39.18723463098884,"longitude":-76.872470061684524},{"site_name":"Meadowbrook Park","id":34,"park_id":"MBP","feature_name":"Meadowbrook Park","address1":"5001 MEADOWBROOK LN","address2":"Ellicott City, MD 21043","description":"This 77-acre park features three baseball fields; an open-play area; a large playground for all abilities; two tennis courts; two basketball courts; two picnic pavilions; and approximately 2.5 miles of sidewalks and pathways circling the park, parking, landscape, and restroom facilities.","feature_type":"PARK","feature_id":"MBP","latitude":39.244790005600663,"longitude":-76.819845646510174},{"site_name":"Middle Patuxent Environmental Area","id":17,"park_id":"MPE","feature_name":"Middle Patuxent Environmental Area","address1":"5795 TROTTER RD","address2":"Clarksville, MD 21029","description":"General Information\\\\n\\\\nHoward County Department of Recreation and Parks manages the 1021-acre Middle Patuxent Environmental Area (MPEA) in cooperation with the Middle Patuxent Environmental Foundation. This natural area is home to a diversity of wildlife, including an impressive list of about 150 species of birds, over 40 species of mammals, and numerous amphibians, reptiles, fishes, butterflies, plants and other wildlife. The primary components of the MPEA’s mission are natural resource conservation, environmental education, research, and passive recreation. The area is managed using ecosystem management concepts to restore and protect the diversity of communities found in this region. Five and one-half miles of hiking trails, with two interpretive nature trail brochures, give visitors an opportunity to enjoy and learn about the area.\\\\n\\\\nOngoing natural resource management projects in the MPEA include meadow habitat restoration, natural resource inventories (bird surveys, vegetation surveys, etc), forest management, deer population management, stream water quality monitoring, and the volunteer program. The objective of the MPEA volunteer program is to involve members of the community in many aspects of the MPEA’s management. Volunteers can become involved in the development and maintenance of our trail system, help fight the invasive exotics that threaten our native species, study the diverse flora and fauna communities, participate in habitat management projects, and/or help develop educational programs.\\\\n\\\\nTrails\\\\n\\\\nWelcome to the Middle Patuxent Environmental Area (MPEA) virtual interpretive nature trail. The MPEA, established in 1996, is 1021 acres in size and contains a diversity of habitat types. There are upland and bottomland hardwood forest, fields, wetlands, ponds, and riparian (riverine) habitats. The primary components of the MPEA\u0027s mission are natural resource management, education, research and recreation. There are 5.4 miles of hiking trails in the MPEA. This brochure will guide you on a virtual tour through the South Wind Trail (2.3 miles), including the grassland restoration area and a wetland area. Numbered markers along the trail (see map) correspond to the numbered interpretive point pictures. ENJOY!","feature_type":"PARK","feature_id":"MPE","latitude":39.208846287380105,"longitude":-76.903744539208034},{"site_name":"North Laurel Park","id":50,"park_id":"NLP","feature_name":"North Laurel Park","address1":"9411 WHISKEY BOTTOM RD","address2":"Laurel, MD 20723","description":"This 40-acre community park, which is set into a residential landscape in North Laurel, features something for everyone seeking outdoor fun. Park amenities include a 12,000 square foot Skate Park, basketball courts, tennis court, playgrounds, pavilion, ball diamonds and sports fields (permit use only).","feature_type":"PARK","feature_id":"NLP","latitude":39.118163962291156,"longitude":-76.838181546088109},{"site_name":"Patuxent Branch Trail","id":79,"park_id":"PBT","feature_name":"Patuxent Branch Trail","address1":"9190 Old Guilford RD","address2":"Columbia, MD 21046","description":"Trek 4.6 miles on the Patuxent Branch Trail that leads you along the Patuxent River from Savage Park to Lake Elkhorn. Along the way are interpretive signs and the historic Guilford Pratt Truss Bridge that spans the Little Patuxent River along Old Guilford Road. The mostly paved pathway provides you with the perfect hiking or biking trail. Runners will also enjoy the variety of terrain that offers challenges for all ability levels. Wildlife is abundant, so bird watching is also a favorite pastime for users of this trail.","feature_type":"PARK","feature_id":"PBT","latitude":39.170584987823659,"longitude":-76.848678670917579},{"site_name":"Poplar Springs Park","id":33,"park_id":"POP","feature_name":"Poplar Springs Park","address1":"918 \u0026 920 WATERSVILLE RD","address2":"Mt. Airy, MD 21771","description":"Located in Lisbon, this open space area provides an oasis of natural habitat just outside of town. This historic park is located in the second oldest settlement in Howard County. The springs on the property were once utilized by Native Americans who traveled the area. Although the water from the spring is undrinkable today, for many years it was considered to be therapeutic. In 1747, the site was home to the Christ Church Chapel of Ease. During the Civil War, the Union Army camped there on their way to Antietam and Gettysburg. Today, all that remains are the ruins of the springhouse. The park consists of a parking area and a nature hiking trail that meanders across streams, through forests and open meadows. There is no lot, so you will need to park on the shoulder of the road. Street parking only available.","feature_type":"PARK","feature_id":"POP","latitude":39.344826689596879,"longitude":-77.096837841088814},{"site_name":"Robinson Nature Center","id":68,"park_id":"RNC","feature_name":"Robinson Nature Center","address1":"6692 Cedar Ln","address2":"Columbia, MD 21044","description":"General Information\\\\n\\\\nThe Robinson Nature Center is a unique nature education facility situated on 18 acres of land adjacent to the Middle Patuxent Environmental Area, which provides over 1,000 acres of forest, meadows and river valley to explore. Geothermal heating/air-conditioning, porous paving, solar panels which generate 15% of electric needs, innovative water conservation methods and a host of other features make this building environmentally friendly and one of only three LEED Certified Platinum buildings in the State. This project was made possible through the foresight and generosity of James and Anne Robinson and the James and Anne Robinson Foundation. Come see for yourself what the center offers:\\\\n\\\\n - Interactive and multisensory exhibits for all ages\\\\n - NatureSphere, a digital planetarium and dome-style theater, with programs and movies\\\\n - Video alcove with ViewSpace, a self-updating multimedia astronomy display\\\\n - Children’s Discovery Room with hands-on activities\\\\n - Nature trail with arboretum and views of the Middle Patuxent River\\\\n - Balcony and green rooftop for outdoor nature viewing\\\\n - Classrooms and auditorium with seating for 150 people","feature_type":"PARK","feature_id":"RNC","latitude":39.190145590098751,"longitude":-76.89522114951626},{"site_name":"Rockburn Branch Park","id":23,"park_id":"RBP","feature_name":"Rockburn Branch Park","address1":"5400 LANDING RD","address2":"Elkridge, MD 21075","description":"Come and explore this 415-acre wooded paradise! Rockburn Branch Park offers 7.4 miles of trails that wind through scenic woodlands, freshwater marshes and stream valleys. In the streams, look for crayfish, minnows, water striders and dragonflies. The East Area offers 4 ball diamonds, 2 multipurpose synthetic turf fields and a playground. Picnic pavilions are available on a first-come-first-served basis, unless reserved. The West Area offers 6 ball diamonds: 2 regular sized, and 4 mini fields that overlap each other located behind the Rockburn Elementary School. Two basketball courts, 3 multi-purpose fields -- 2 are mini fields and 1 is regular sized -- 4 tennis courts, an 18-hole disc golf course and a playground are also located in the South area. Enjoy hiking trails that connect both areas. This is a popular park for sports groups and nature lovers alike! The Park is open from 7am until dusk, or as posted. You may use the park\u0027s picnic tables and cooking grills on a first-come-first-served basis except when picnic areas have been reserved. Personal grills and hibachis are not permitted.\\\\n\\\\nPark regulations prohibit hunting, firearms, and alcoholic beverages. Leashed pets are allowed in the park but not in picnic or sports areas. Howard County law requires owners to clean up after their pets.","feature_type":"PARK","feature_id":"RBP","latitude":39.218025445439984,"longitude":-76.765309192321439},{"site_name":"Savage Park","id":1,"park_id":"SAV","feature_name":"Savage Park","address1":"8400 FAIR ST","address2":"Savage, MD 20763","description":"Savage Park offers many opportunities for discovering wildlife, wildflowers and natural history along 2.8 miles of interconnecting trails, including links to Patuxent Branch Trail and Lake Elkhorn.\\\\n\\\\nThe Savage Loop Trail offer different lengths and terrains for hikers and bikers of various skill levels. The park environment offers an abundance of recreational areas such as 5 ball diamonds (permit use only); 2 basketball courts; 2 horseshoe pits; a picnic pavilion available on a first-come-first-served basis, unless reserved; 4 lighted tennis courts, 2 volleyball courts, a playground and restroom facilities. The outfields of ball diamonds 1-4 can be permitted out to serve as a multipurpose field or a mini-soccer field, but no goals are provided. Ball diamond 5 will be lighted. Personal grills and hibachis are permitted. Don’t forget to explore the historic Bollman Truss Bridge and Savage Mill during your visit. The Park is open from 7 AM to dusk, or as posted. Park regulations prohibit hunting, firearms, swimming and alcoholic beverages (unless consumed in a rented pavilion). Leashed pets are allowed in the park but not in picnic or sports areas. Howard County law requires owners to clean up after their pets. Park Rangers are on patrol. To report damage or park concerns, leave a message on the Department\u0027s hot-line, 410-313-DIRT (3478). The Savage Boys and Girls Club operates the concession during its programs. Trout fishing on the Little Patuxent are: creel limit (all trout species) in aggregate—two daily, two possession; no minimum size; no closed season; no restrictions on terminal tackle.","feature_type":"PARK","feature_id":"SAV","latitude":39.139925991046319,"longitude":-76.829448716424423},{"site_name":"Schooley Mill Park","id":31,"park_id":"SMP","feature_name":"Schooley Mill Park","address1":"12975 HALL SHOP RD","address2":"Highland, MD 20777","description":"Schooley Mill Park offers a wide variety of habitats including wetlands, woodlands, and meadows. Wildlife thrive in these meadows that are maintained in a natural state to provide food, cover, and nest sites. This hidden gem is a peaceful place to relax and enjoy nature. Peer into the stream to see minnows, crayfish, frogs, and turtles. 4.6 miles of trails provide an excellent way to discover the natural side of Schooley Mill Park. The park also includes 3 ball diamonds, 2 basketball courts, the county\u0027s only regulation-sized cricket field, an indoor facility (permit required), 4 tennis courts and 3 equestrian rings (available on a first-come, first-served basis unless previously reserved). The park is open 7 am to dusk, or as posted. Personal grills and hibachis are not permitted. Park regulations prohibit hunting, firearms, and alcoholic beverages. Leashed pets are allowed in the park but not in picnic or sports areas.","feature_type":"PARK","feature_id":"SMP","latitude":39.165082777366258,"longitude":-76.958593507863881},{"site_name":"Sewells Orchard Park","id":38,"park_id":"SOP","feature_name":"Sewells Orchard Park","address1":"6455 SEWELLS ORCHARD DR","address2":"Columbia, MD 21045","description":"A lovely location for viewing nature, this 25-acre park offers a playground and picnic tables, plus three ponds with a .9-mile paved pathway around the perimeter. Enjoy relaxing along the three ponds while you make your way along the path.","feature_type":"PARK","feature_id":"SOP","latitude":39.198335486958221,"longitude":-76.827787817798523},{"site_name":"South Branch Park","id":59,"park_id":"SYK","feature_name":"South Branch Park","address1":"350 West Friendship Rd","address2":"Sykesville, MD 21784","description":"Construction is starting in early July 2014 on the First Phase of improvements for the 7.5 acre South Branch Park, located across the Patapsco River from the town of Sykesville. New facilities will include a playground and a picnic shelter, connected by a paved accessible walkway to two handicap parking spaces. The old water-tower, which had become a hazard, has already been taken down. The project is being done in conjunction with the Town of Sykesville, which has been renting and maintaining the property for the past several years under an agreement with the County.\\\\nIn the spring, a charrette was held in the Town Hall to gather ideas from the public for the use of the historic warehouse known as the “Apple Butter Factory.” Future plans will include renovations to enable the re-use of the building, as well as provide additional parking. An existing concrete slab that is currently used for skateboarding, will also undergo future improvements as a skate-park. New amenities, such as benches and historic interpretive signage for the historic structures on the site, will also be added.\\\\n\\\\nThe park serves as a gateway to both Howard and Carroll Counties, and has been enjoyed for limited passive recreation since its acquisition by the County in 1994, and the addition of a small parking area, fencing and landscaping. The site is the location of several historic structures, including the Sykes House, and a Weigh Station for farm produce that was canned at the Apple Butter Factory.\\\\nThat section of the park will be closed to visitors for the duration of the construction, which will last several weeks.","feature_type":"PARK","feature_id":"SYK","latitude":39.363158426113813,"longitude":-76.96986068586952},{"site_name":"Tiber Park","id":24,"park_id":"TIB","feature_name":"Tiber Park","address1":"8061 MAIN ST","address2":"Ellicott City, MD 21043","description":"The smallest park in Howard County is in the perfect location, as it sits in Tiber Alley just off the unique and historic Main Street in Old Ellicott City. ","feature_type":"PARK","feature_id":"TIB","latitude":39.267408353017444,"longitude":-76.795683978813315},{"site_name":"Troy Park at Elkridge","id":35,"park_id":"THP","feature_name":"Troy Park at Elkridge","address1":"6500 MANSION LN","address2":"Elkridge, MD 21075","description":"Phase 1 of Troy Park at Elkridge included the construction of the entrance road; two lighted synthetic multipurpose fields with press box structures and bleacher seating for 330; mass grading for additional amenities; and parking areas that include bio-retention islands with trees and plants to filter stormwater. Additionally, the playground included in phase 2 will be completed in mid-October. Phase 1 cost $8 million; all five phases are projected to cost an estimated $45.8 million.\\\\n\\\\nAdditional phases of the project will include two more lighted synthetic multipurpose fields, one of which will be a stadium field with seating for 1,500 and a lighting system to host televised night games; three lighted synthetic turf baseball fields; pavilions; trails; additional parking, a community center and indoor sports complex.\\\\n\\\\nThe park area, which currently encompasses 101 acres, has a history that dates back to 1664, when John Dorsey patented 763 acres as part of the Upper Anne Arundel tract and called the property “Troy” after his family’s ancestral home in Ireland. In the nearly 400 years since then, the property has been divided up and sold. Howard County purchased 80 of the 101 acres with $2.1 million from the Department of Natural Resources Program Open Space. In 2011 the county began developing plans for the park and it held a construction groundbreaking on June 22, 2013.\\\\n\\\\nTroy Park at Elkridge is Howard County’s eighth regional park, joining Blandair, Cedar Lane, Centennial, Rockburn Branch, Savage, Schooley Mill and Western Regional.","feature_type":"PARK","feature_id":"THP","latitude":39.193762753563,"longitude":-76.757664592122609},{"site_name":"Warfield Pond Park","id":22,"park_id":"WPP","feature_name":"Warfield Pond Park","address1":"14523 MCCLINTOCK DR","address2":"Glenwood, MD 21738","description":"Are you heading west? Stop by this 20-acre neighborhood park and walk the .6 mile paved path and boardwalk around the pond to spot a variety of turtles and amphibians.\\\\n\\\\nThis community park in western Howard County provides a small pavilion, a playground, 2 tennis courts, and a basketball court for all to enjoy. Get a “two for one” deal when you combine the sights and sounds at the pond with the laughter and cheers from the athletic courts!","feature_type":"PARK","feature_id":"WPP","latitude":39.275368681916824,"longitude":-77.019696737927944},{"site_name":"Waterloo Park","id":21,"park_id":"WAT","feature_name":"Waterloo Park","address1":"6951 OLD WATERLOO RD","address2":"Elkridge, MD 21075","description":"Situated at the end of Old Waterloo Road, this 22-acre park is a great setting for a family get-together! There are 2 picnic pavilions, a playground, basketball court, 2 tennis courts, a ball diamond and multipurpose field. The .5 mile of paved pathway leading through the woods is a perfect place for a nature walk with family and friends.","feature_type":"PARK","feature_id":"WAT","latitude":39.1832487937889,"longitude":-76.784697601786533},{"site_name":"West Friendship Park","id":12,"park_id":"WFP","feature_name":"West Friendship Park","address1":"12985 FREDERICK RD","address2":"West Friendship, MD 21794","description":"Come visit The Howard County Living Farm Heritage Museum at West Friendship Park.","feature_type":"PARK","feature_id":"WFP","latitude":39.296733351182539,"longitude":-76.9704812486726},{"site_name":"Western Regional Park","id":13,"park_id":"WRP","feature_name":"Western Regional Park","address1":"14800 CARRS MILL RD","address2":"Woodbine, MD 21723","description":"You have an invitation to the rich, scenic countryside! There is plenty to keep you entertained at this 190 acre park. Enjoy 4 premium grass multi-purpose sport fields, 2 lighted synthetic turf fields, tennis courts and a playground. There are also 5 ball diamonds, one lighted baseball fields and 2 basketball courts. There are five pavilions available on a first-come, first-served basis. As an added bonus, the Gary J. Arthur Community Center at Glenwood and the Library are only a stone’s throw away! For information about the Gary J. Arthur Community Center at Glenwood, located within the park, visit the center\u0027s web page. Additional park facilities planned and/or under construction include three additional natural grass multipurpose fields, a tee ball field, a baseball field, five picnic pavilions, pathways, nature/horse trails, three restroom facilities, and a maintenance facility. The park is open from 7 am to dusk or as posted. Park regulations prohibit hunting, firearms, and alcoholic beverages. Leashed pets are allowed in the park but not in picnic, playground or sports areas. Howard County law requires owners to clean up after their pets.","feature_type":"PARK","feature_id":"WRP","latitude":39.305688695509794,"longitude":-77.02839450046838},{"site_name":"Wincopin Trails","id":61,"park_id":"WIN","feature_name":"Wincopin Trails","address1":"9299 Vollmerhausen RD","address2":"Jessup, MD 20794","description":"Widely used by avid hikers and mountain bikers, this trail system is 3.4 miles long with naturally surfaced paths. Trails are not ADA accessible and are meant for experienced hikers and riders.\\\\n\\\\nUtilizing this trail is a great way to enjoy nature in one of the most beautiful areas of Howard County, and get your exercise at the same time! There are also subtrails to enjoy.","feature_type":"PARK","feature_id":"WIN","latitude":39.142448323481439,"longitude":-76.831930024601277},{"site_name":"Worthington Dog Park","id":65,"park_id":"WOR","feature_name":"Worthington Dog Park","address1":"8170 Hillsborough RD","address2":"Ellicott City, MD 21043","description":"Come and bark in the park at Howard County\u0027s premier dog park! Your pooch will have a great time socializing and running without the confines of a leash. Whether you are a big-dog family, a little-dog family, or in between, you can find the appropriate place for your furry friend in one of two separate enclosures: the regular area and the small, timid, or elderly dog area. There are also fenced areas for rent and dog training is available. The off-leash area is open seasonally, weather permitting.","feature_type":"PARK","feature_id":"WOR","latitude":39.250565741337176,"longitude":-76.798337981119431}]